СЦ_Мобильное/src/Enums/РежимПолученияОжидаемыхЗаказов/РежимПолученияОжидаемыхЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимПолученияОжидаемыхЗаказов</name>
  <enumValues>
    <name>ПоМагазину</name>
  </enumValues>
  <enumValues>
    <name>ПоРеестру</name>
  </enumValues>
  <enumValues>
    <name>ПоЗабору</name>
  </enumValues>
</mdclass:Enum>

СЦ_Мобильное/src/CommonModules/МодульСервис/Module.bsl
Процедура УдалитьМагазины() Экспорт
	Обр = Обработки.УдалениеЛишнихМагазинов.Создать();
	Обр.УдалитьЛишниеМагазины();	
КонецПроцедуры	

Процедура УстановитьРежимОприходования(НомерРежима) Экспорт
	Если НомерРежима = "1" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоЗабору);
	ИначеЕсли НомерРежима = "2" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоМагазину);
	ИначеЕсли НомерРежима = "3" Тогда
		Константы.РежимПолученияОжидаемыхЗаказов.Установить(Перечисления.РежимПолученияОжидаемыхЗаказов.ПоРеестру);
	КонецеСли;	
КонецПроцедуры
